#/*
#    === APPS NOT AVAILABE @ 2022.01.10 ===

#    * Roast Time
#    * Luminar
#    * AirMagic
#*/

# Taps
tap 'homebrew/cask-cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'cloudfoundry/tap'

# tap 'homebrew/bundle'
# tap 'homebrew/dupes'
# tap 'homebrew/php'

# Install Fish Shell
brew 'fish'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'cloc'
brew 'git'
brew 'helm'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'wget'
brew 'obsidian'

# Development
brew 'cloudfoundry/tap/cf-cli'
brew 'go'
brew 'hugo'
brew 'nvm'
brew 'mariadb', restart_service: true
brew 'rustup-init'
brew 'setapp'
brew 'terraform'
brew 'wakatime-cli'


# Apps

cask '1password'
# cask 'aerial'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'azure-data-studio'
cask 'backblaze'
cask 'bartender'
# cask 'brave-browser'
cask 'bunch'
cask 'choosy'
cask 'docker'
cask 'microsoft-edge'
# cask 'dropbox' # this gets installed before anything else so remove
cask 'farrago'
cask 'fig'
cask 'fission'
cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite'
cask 'hazel'
cask 'hyper'
cask 'insomnia'
cask 'istat-menus'
cask 'iterm2'
cask 'keyboard-maestro'
cask 'loopback'
cask 'mark-text'
cask 'microblog'
cask 'monodraw'
cask 'omnigraffle'
cask 'opera'
cask 'piezo'
cask 'plantronics-hub'
cask 'proxifier'
cask 'quik'
cask 'rocket'
cask 'runjs'
cask 'screenflow'
cask 'setapp'
cask 'slack'
cask 'soundsource'
cask 'soulver'
cask 'superduper'
cask 'typora'
cask 'ubersicht'
cask 'visual-studio-code'

# Quicklook
cask 'azure-data-studio'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'quicklookase'
cask 'qlstephen'
cask 'qlvideo'
cask 'suspicious-package'
cask 'webpquicklook'

# Fonts
cask 'font-manrope'
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'DaisyDisk', id: 411643860
mas 'Day One', id: 1055511498
mas 'Deliveries', id: 924726344
mas 'Final Cut Pro', id: 424389933
mas 'Icon Slate', id: 439697913
mas 'Moom', id: 419330170
mas 'OneDrive', id: 823766827
mas 'Paprika Recipe Manager', id: 451907568
mas 'Patterns', id: 429449079
mas 'Pixelmator Pro', id: 1289583905
mas 'Plash', id: 1494023538
mas 'Reeder', id: 880001334
mas 'Spark – Email App by Readdle', id: 1176895641
mas 'Tweetbot', id: 557168941
mas 'UTC Time', id: 1538245904
mas 'Xcode', id: 497799835
mas 'xScope', id: 889428659
