# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'cloudfoundry/tap'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install Fish Shell
brew 'fish'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'git'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'wget'

# Development
brew 'cloudfoundry/tap/cf-cli'
brew 'go'
#brew 'nvm' # not supported so using curl per recommendation
brew 'php71', args: ['with-debug']
brew 'php71-intl'
brew 'mariadb'
brew 'mongodb'
brew 'speed-cli'
brew 'terraform'
brew 'wakatime-cli'

# Apps
cask '1password'
cask 'aerial'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'arq'
cask 'banktivity'
cask 'bartender'
cask 'choosy'
# cask 'dropbox' # this gets installed before anything else so remove
cask 'evernote'
cask 'firefox'
cask 'fluid'
cask 'google-chrome'
cask 'google-drive'
cask 'handbrake'
cask 'hazel'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'keyboard-maestro'
cask 'little-snitch'
cask 'monodraw'
cask 'navicat-for-sql-server'
cask 'omnigraffle'
cask 'opera'
cask 'proxifier'
cask 'quik'
cask 'screenflow'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'studio-3t'
cask 'superduper'
cask 'tower'
cask 'transmit'
cask 'typora'
cask 'ubersicht'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'quicklookase'
cask 'qlstephen'
cask 'qlvideo'
cask 'suspicious-package'
cask 'webpquicklook'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Amphetamine', id: 937984704
mas 'Bear', id: 1091189122
mas 'DaisyDisk', id: 411643860
mas 'Day One', id: 1055511498
mas 'Deliveries', id: 924726344
mas 'EyeFriendly', id: 587769990
mas 'Fantastical 2 - Calendar and Reminders', id: 975937182
mas 'Final Cut Pro', id: 424389933
mas 'Kindle', id: 405399194
mas 'MindNode', id: 992076693
mas 'Moom', id: 419330170
mas 'Napkin', id: 581789185
mas 'Newton', id: 1059655371
mas 'OneDrive', id: 823766827
mas 'Paprika Recipe Manager', id: 451907568
mas 'Patterns', id: 429449079
mas 'Paw', id: 584653203
mas 'Pixave', id: 924891282
mas 'Reeder', id: 880001334
mas 'Soulver', id: 413965349
mas 'Thumbtack', id: 500948998
mas 'Todoist', id: 585829637
mas 'Tweetbot', id: 557168941
mas 'Ultra Character Map, id: 520265986
mas 'Ulysses', id: 623795237
mas 'Xcode', id: 497799835
mas 'xScope', id: 889428659
